// Задача 19/ Напишите программу, которая принимает на вход пятизначное число и проверяет,
//является ли оно палиндромом. 14212 -> нет, 12821 -> да, 23432 -> да




internal class Program
{
  using (resource)
 
    private static void Main(string[] args)
    {
       Console.Write(value: "введите число");
      int num = Value;
        char[] obrnum = num.ToCharArray();
        {
            Array.Reverse(obrnum);
            string result = new (obrnum);
            if   (num == obrnum)

            {
           
}
} 
            {
                Console.WriteLine("Палиндром");
                {
                    Console.WriteLine("НЕТ");
                }
            }
        }
    }
